Reports/КнигаАналитическогоУчетаДепонированнойЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>КнигаАналитическогоУчетаДепонированнойЗарплаты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСДепонентамиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСДепонентамиОрганизаций</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ведомость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗарплатаКВыплатеОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗанятостиВОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыЗанятостиВОрганизации</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновноеМестоРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Совместительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееСовместительство</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныИзмененияСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ПричиныИзмененияСостояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/КнигаАналитическогоУчетаДепонированнойЗарплаты/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
Функция ПроверкаПериода()

	ПроверкаПройдена = Истина;

	Если ДатаНач > ДатаКон Тогда

		Предупреждение(НСтр("ru='Неправильно задан период формирования отчета!';uk='Неправильно заданий період формування звіту!'")+Символы.ПС+
		               НСтр("ru='Дата начала больше даты окончания периода.';uk='Дата початку більше дати закінчення періоду.'"));

		ПроверкаПройдена = Ложь;

	ИначеЕсли ДатаНач = '00010101' Тогда

		Предупреждение(НСтр("ru='Не указана дата начала отчета';uk='Не зазначена дата початку звіту'"));

		ПроверкаПройдена = Ложь;

	ИначеЕсли ДатаКон = '00010101' Тогда

		Предупреждение(НСтр("ru='Не указана дата конца отчета';uk='Не зазначена дата кінця звіту'"));

		ПроверкаПройдена=Ложь;

	КонецЕсли;

	Возврат ПроверкаПройдена;

КонецФункции // ПроверкаПериода()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура СформироватьОтчет(ДокументРезультат) Экспорт
	
	Если НЕ ПроверкаПериода() Тогда
		Возврат;
	КонецЕсли;
	
	Если Организация.Пустая() Тогда
		Сообщить(НСтр("ru='Не выбрана организация.';uk='Не обрана організація.'"));
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("Приход", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ПустаяДата", '00010101');
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВнутреннееСовместительство", Перечисления.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство);
	Запрос.УстановитьПараметр("Уволен", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПоследних.Сотрудник.Код			КАК ТабельныйНомер,	                                                           
	|	Депоненты.Сотрудник										КАК Сотрудник,
	|	Депоненты.Сотрудник.ФизЛицо								КАК ФизЛицо,
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, Депоненты.Физлицо.Наименование) КАК ФИО,
	|	Депоненты.Ведомость КАК Ведомость,
	|	Депоненты.Ведомость.Номер КАК Номер,
	|	Депоненты.Ведомость.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА Депоненты.Период < &ДатаНач
	|			ТОГДА &ПустаяДата
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(Депоненты.Период, МЕСЯЦ)
	|	КОНЕЦ КАК Поле,
	|	Депоненты.Период КАК Период,
	|	НАЧАЛОПЕРИОДА(Депоненты.Период, МЕСЯЦ) КАК Месяц,
	|	Депоненты.Остаток КАК НачальныйОстаток,
	|	ВзаиморасчетыСДепонентамиОрганизацийОбороты.Период КАК МесяцВыплаты,
	|	ВзаиморасчетыСДепонентамиОрганизацийОбороты.СуммаРасход КАК СуммаРасход
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.Организация КАК Организация,
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.Сотрудник КАК Сотрудник,
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.Сотрудник.ФизЛицо	КАК ФизЛицо,
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.Ведомость КАК Ведомость,
	|		МИНИМУМ(ВзаиморасчетыСДепонентамиОрганизаций.Период) КАК Период,
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.СуммаОстаток КАК Остаток
	|	ИЗ
	|		РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций.Остатки(&ДатаНач, Организация = &Организация) КАК ВзаиморасчетыСДепонентамиОрганизацийОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций КАК ВзаиморасчетыСДепонентамиОрганизаций
	|			ПО ВзаиморасчетыСДепонентамиОрганизацийОстатки.Организация = ВзаиморасчетыСДепонентамиОрганизаций.Организация
	|				И ВзаиморасчетыСДепонентамиОрганизацийОстатки.Сотрудник = ВзаиморасчетыСДепонентамиОрганизаций.Сотрудник
	|				И ВзаиморасчетыСДепонентамиОрганизацийОстатки.Ведомость = ВзаиморасчетыСДепонентамиОрганизаций.Ведомость
	|	ГДЕ
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.СуммаОстаток > 0
	|		И ВзаиморасчетыСДепонентамиОрганизаций.ВидДвижения = &Приход
	|		И ВзаиморасчетыСДепонентамиОрганизаций.Сумма > 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.Сотрудник,
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.Сотрудник.ФизЛицо,
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.Ведомость,
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.Организация,
	|		ВзаиморасчетыСДепонентамиОрганизацийОстатки.СуммаОстаток
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НовыеДепоненты.Организация,
	|		НовыеДепоненты.Сотрудник,
	|		НовыеДепоненты.Сотрудник.ФизЛицо,
	|		НовыеДепоненты.Ведомость,
	|		НовыеДепоненты.Период,
	|		ВзаиморасчетыСДепонентамиОрганизаций.Сумма
	|	ИЗ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ВзаиморасчетыСДепонентамиОрганизаций.Организация КАК Организация,
	|			ВзаиморасчетыСДепонентамиОрганизаций.Сотрудник КАК Сотрудник,
	|			ВзаиморасчетыСДепонентамиОрганизаций.Сотрудник.ФизЛицо	КАК ФизЛицо,
	|			ВзаиморасчетыСДепонентамиОрганизаций.Ведомость КАК Ведомость,
	|			МИНИМУМ(ВзаиморасчетыСДепонентамиОрганизаций.Период) КАК Период
	|		ИЗ
	|			РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций КАК ВзаиморасчетыСДепонентамиОрганизаций
	|		ГДЕ
	|			ВзаиморасчетыСДепонентамиОрганизаций.ВидДвижения = &Приход
	|			И ВзаиморасчетыСДепонентамиОрганизаций.Сумма > 0
	|			И ВзаиморасчетыСДепонентамиОрганизаций.Организация = &Организация
	|			И ВзаиморасчетыСДепонентамиОрганизаций.Период МЕЖДУ &ДатаНач И &ДатаКон
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВзаиморасчетыСДепонентамиОрганизаций.Сотрудник,
	|			ВзаиморасчетыСДепонентамиОрганизаций.Сотрудник.ФизЛицо,
	|			ВзаиморасчетыСДепонентамиОрганизаций.Ведомость,
	|			ВзаиморасчетыСДепонентамиОрганизаций.Организация) КАК НовыеДепоненты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций КАК ВзаиморасчетыСДепонентамиОрганизаций
	|			ПО НовыеДепоненты.Период = ВзаиморасчетыСДепонентамиОрганизаций.Период
	|				И НовыеДепоненты.Организация = ВзаиморасчетыСДепонентамиОрганизаций.Организация
	|				И НовыеДепоненты.Сотрудник = ВзаиморасчетыСДепонентамиОрганизаций.Сотрудник
	|				И НовыеДепоненты.Ведомость = ВзаиморасчетыСДепонентамиОрганизаций.Ведомость) КАК Депоненты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСДепонентамиОрганизаций.Обороты(&ДатаНач, &ДатаКон, Месяц, Организация = &Организация) КАК ВзаиморасчетыСДепонентамиОрганизацийОбороты
	|		ПО Депоненты.Сотрудник = ВзаиморасчетыСДепонентамиОрганизацийОбороты.Сотрудник
	|			И Депоненты.Ведомость = ВзаиморасчетыСДепонентамиОрганизацийОбороты.Ведомость
	|			И Депоненты.Организация = ВзаиморасчетыСДепонентамиОрганизацийОбороты.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаКон, ) КАК ФИОФизЛицСрезПоследних
	|		ПО Депоненты.Сотрудник.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|		&ДатаКон,
	|		Организация = &ГоловнаяОрганизация
	|		    И (Сотрудник.ВидЗанятости <> &ВнутреннееСовместительство
	|		        ИЛИ Сотрудник.ВидЗанятости ЕСТЬ NULL )) КАК РаботникиОрганизацийСрезПоследних
	|		ПО Депоненты.Сотрудник = РаботникиОрганизацийСрезПоследних.Сотрудник
	|			И (РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> &Уволен)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Поле,
	|	Период,
	|	ФИО,
	|	Ведомость";
	
	Выборка = Запрос.Выполнить().Выбрать();
	ВсегоСтрокДокумента = Выборка.Количество();
	
	ДокументРезультат.Очистить();
	Макет = ПолучитьМакет("КнигаУчета");
	КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	ОбластьМакетаШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
	ОбластьМакетаШапка			= Макет.ПолучитьОбласть("Шапка");
	ОбластьМакетаСтрока 		= Макет.ПолучитьОбласть("Строка");
	ОбластьМакетаОстатокНаНачало = Макет.ПолучитьОбласть("ОстатокНаНачало");
	ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал");
	ОбластьМакетаПодвалМесяца	= Макет.ПолучитьОбласть("ПодвалМесяца");
	
	ОбластьМакетаШапкаДокумента.Параметры.Организация = ?(ПустаяСтрока(Организация.НаименованиеПолное),Организация.Наименование,Организация.НаименованиеПолное);
	ОбластьМакетаШапкаДокумента.Параметры.ДатаC = Формат(ДатаНач,"Л="+Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать)+"; ДЛФ=DD");
	ОбластьМакетаШапкаДокумента.Параметры.ДатаПо = Формат(ДатаКон,"Л="+Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать)+"; ДЛФ=DD");
	ДокументРезультат.Вывести(ОбластьМакетаШапкаДокумента);
	ДокументРезультат.Вывести(ОбластьМакетаШапка);
	
	// массив с двумя строками - для разбиения на страницы
    ВыводимыеОбласти = Новый Массив();
	ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
	ВыводимыеОбласти.Добавить(ОбластьМакетаПодвалМесяца);
	
	ОстатокНаКонец = 0;
	ОстатокНаНачалоВыведен = Ложь;
	РасходМесяца = Новый Массив;
	Для Сч = 1 По 12 Цикл
		РасходМесяца.Добавить(0)	
	КонецЦикла; 
	
	ВыведеноСтрок = 0;
	Пока Выборка.СледующийПоЗначениюПоля("Поле") Цикл
		
		ПриходМесяца = 0;
		
		Если Выборка.Поле > '00010101' И Не ОстатокНаНачалоВыведен Тогда
			ОбластьМакетаОстатокНаНачало.Параметры.ОстатокНаНачало = ПриходМесяца;
			ДокументРезультат.Вывести(ОбластьМакетаОстатокНаНачало);
		КонецЕсли;
		
		Пока Выборка.СледующийПоЗначениюПоля("Период") Цикл
			Пока Выборка.СледующийПоЗначениюПоля("ФИО") Цикл
				Пока Выборка.СледующийПоЗначениюПоля("Ведомость") Цикл
					ОбластьМакетаСтрока.Параметры.Заполнить(Выборка);
					ОбластьМакетаСтрока.Параметры.Дата = Формат(ОбластьМакетаСтрока.Параметры.Дата,"ДФ=dd.MM.yyyy");
					ПриходМесяца = ПриходМесяца + Выборка.НачальныйОстаток;
					ОстатокНаКонец = ОстатокНаКонец + Выборка.НачальныйОстаток;
					Для СчМес = 1 По 12 Цикл
						ОбластьМакетаСтрока.Параметры["МесяцВыплаты" + СчМес] = 0;						
					КонецЦикла;
					Пока Выборка.Следующий() Цикл // по месяцам выплаты	
						Если ЗначениеЗаполнено(Выборка.МесяцВыплаты) Тогда
							ТекущийМесяцВыплаты = Месяц(Выборка.МесяцВыплаты);
							ОбластьМакетаСтрока.Параметры["МесяцВыплаты" + ТекущийМесяцВыплаты] = Выборка.СуммаРасход;
							РасходМесяца[ТекущийМесяцВыплаты - 1] = РасходМесяца[ТекущийМесяцВыплаты - 1] + Выборка.СуммаРасход;
							ОстатокНаКонец = ОстатокНаКонец - Выборка.СуммаРасход;
						КонецЕсли;
					КонецЦикла;
					// разбиение на страницы
					ВыведеноСтрок = ВыведеноСтрок + 1;
					// Проверим, уместится ли строка на странице или надо открывать новую страницу
					ВывестиПодвалЛиста = Не ДокументРезультат.ПроверитьВывод(ВыводимыеОбласти);
					Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
						ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
						ВывестиПодвалЛиста = Не ДокументРезультат.ПроверитьВывод(ВыводимыеОбласти);
					КонецЕсли;
					Если ВывестиПодвалЛиста Тогда
						ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						ДокументРезультат.Вывести(ОбластьМакетаШапка);
					КонецЕсли;
					ДокументРезультат.Вывести(ОбластьМакетаСтрока);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		Если Выборка.Поле = '00010101' Тогда
			ОбластьМакетаОстатокНаНачало.Параметры.ОстатокНаНачало = ПриходМесяца;
			ОстатокНаНачалоВыведен = Истина;
			// Проверим, уместится ли строка на странице или надо открывать новую страницу
			ВывестиПодвалЛиста = Не ДокументРезультат.ПроверитьВывод(ОбластьМакетаОстатокНаНачало);
			Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
				ВыводимыеОбласти.Очистить();
				ВыводимыеОбласти.Добавить(ОбластьМакетаОстатокНаНачало);
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвалМесяца);
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
				ВывестиПодвалЛиста = Не ДокументРезультат.ПроверитьВывод(ВыводимыеОбласти);
			КонецЕсли;
			Если ВывестиПодвалЛиста Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				ДокументРезультат.Вывести(ОбластьМакетаШапка);
			КонецЕсли;
			ДокументРезультат.Вывести(ОбластьМакетаОстатокНаНачало);
			Если ВыведеноСтрок = ВсегоСтрокДокумента Тогда
			ОбластьМакетаПодвалМесяца.Параметры.НадписьПриходМесяца = НСтр("ru='Итого задепонировано за :';uk='Разом задепоновано за :'",КодЯзыкаПечать);	
			ОбластьМакетаПодвалМесяца.Параметры.НадписьРасходМесяца = НСтр("ru='Итого выплачено (списано) за :';uk='Разом виплачено (списано) за :'",КодЯзыкаПечать);	
				ДокументРезультат.Вывести(ОбластьМакетаПодвалМесяца);
			КонецЕсли;
		Иначе
			ОбластьМакетаПодвалМесяца.Параметры.НадписьПриходМесяца = НСтр("ru='Итого задепонировано за ';uk='Разом задепоновано за '",КодЯзыкаПечать) + Формат(Выборка.Поле,"Л="+Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать)+"; ДФ='ММММ гггг'");	
			ОбластьМакетаПодвалМесяца.Параметры.НадписьРасходМесяца = НСтр("ru='Итого выплачено (списано) за ';uk='Разом виплачено (списано) за '",КодЯзыкаПечать) + Формат(Выборка.Поле,"Л="+Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать)+"; ДФ='ММММ гггг'");	
			ОбластьМакетаПодвалМесяца.Параметры.ПриходМесяца = ПриходМесяца;	
			ОбластьМакетаПодвалМесяца.Параметры.РасходМесяца = РасходМесяца[Месяц(Выборка.Поле) - 1];	
			
			// Проверим, уместится ли строка на странице или надо открывать новую страницу
			ВывестиПодвалЛиста = Не ДокументРезультат.ПроверитьВывод(ОбластьМакетаПодвалМесяца);
			Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
				ВыводимыеОбласти.Очистить();
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвалМесяца);
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
				ВывестиПодвалЛиста = Не ДокументРезультат.ПроверитьВывод(ВыводимыеОбласти);
			КонецЕсли;
			Если ВывестиПодвалЛиста Тогда
				ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				ДокументРезультат.Вывести(ОбластьМакетаШапка);
			КонецЕсли;
			ДокументРезультат.Вывести(ОбластьМакетаПодвалМесяца);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// если не было ни одного работника - выводим пустой бланк
    ВыводимыеОбласти = Новый Массив();
	ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
	ВыводимыеОбласти.Добавить(ОбластьМакетаПодвалМесяца);
	ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
	Для Сч = 1 По ОбластьМакетаСтрока.Параметры.Количество() Цикл
		ОбластьМакетаСтрока.Параметры.Установить(Сч - 1,""); 
	КонецЦикла;
	ОбластьМакетаСтрока.Параметры.ФИО = " " + Символы.ПС + " ";
	Пока ДокументРезультат.ПроверитьВывод(ВыводимыеОбласти) Цикл
		ДокументРезультат.Вывести(ОбластьМакетаСтрока);
	КонецЦикла;
	
	ОбластьМакетаПодвал.Параметры.ОстатокНаКонец = ОстатокНаКонец;
	ДокументРезультат.Вывести(ОбластьМакетаПодвал);
	
	ДокументРезультат.ТолькоПросмотр=Истина;
	
КонецПроцедуры // СформироватьРезультат()

#КонецЕсли
